package day07;

public class Exam2 {
    
}
/*
 메소드 
    1) 클래스 내부선언
    2) 목적 : 재사용 , 인수에 따른 서로 다른 결과물 반환
    3) 선언 
        반환타입 메소드명 ( 타입 매개변수){
            return 반환값
        }
        - 반환타입 : 반환값의 타입/  자료형 일치
        - 메소드명 : 소문자 시작하는 카멜표기법
        - 타입 매개변수 : 함수호출 하는 곳으로 전달받느 값 타입 일치!!
        - { } : 함수호출시 실행할 코드 
        - return : 함수종료시 반환되는 값
    4) 호출 : 다양한 기준 ;
*/




class 계산기 {
    // 1. 맴버변수
    // 2. 생성자 
    // 3. 메소드/함수
    // 1) 매개변수 x 반환값 0
    double getPI(){
        return 3.14;
    }
}